EmcraftSystems/linux-upstream/arch/arm/boot/dts/kinetis-pinfunc.h
/*
 * Copyright 2017 Emcraft Systems
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 */

#ifndef __DTS_KINETIS_PINFUNC_H
#define __DTS_KINETIS_PINFUNC_H

#define ALT0	0x0
#define ALT1	0x1
#define ALT2	0x2
#define ALT3	0x3
#define ALT4	0x4
#define ALT5	0x5
#define ALT6	0x6
#define ALT7	0x7

#define PORTA_0		0
#define PORTA_1		1
#define PORTA_2		2
#define PORTA_3		3
#define PORTA_4		4
#define PORTA_5		5
#define PORTA_6		6
#define PORTA_7		7
#define PORTA_8		8
#define PORTA_9		9
#define PORTA_10	10
#define PORTA_11	11
#define PORTA_12	12
#define PORTA_13	13
#define PORTA_14	14
#define PORTA_15	15
#define PORTA_16	16
#define PORTA_17	17
#define PORTA_18	18
#define PORTA_19	19
#define PORTA_20	20
#define PORTA_21	21
#define PORTA_22	22
#define PORTA_23	23
#define PORTA_24	24
#define PORTA_25	25
#define PORTA_26	26
#define PORTA_27	27
#define PORTA_28	28
#define PORTA_29	29
#define PORTA_30	30
#define PORTA_31	31
#define PORTB_0		32
#define PORTB_1		33
#define PORTB_2		34
#define PORTB_3		35
#define PORTB_4		36
#define PORTB_5		37
#define PORTB_6		38
#define PORTB_7		39
#define PORTB_8		40
#define PORTB_9		41
#define PORTB_10	42
#define PORTB_11	43
#define PORTB_12	44
#define PORTB_13	45
#define PORTB_14	46
#define PORTB_15	47
#define PORTB_16	48
#define PORTB_17	49
#define PORTB_18	50
#define PORTB_19	51
#define PORTB_20	52
#define PORTB_21	53
#define PORTB_22	54
#define PORTB_23	55
#define PORTB_24	56
#define PORTB_25	57
#define PORTB_26	58
#define PORTB_27	59
#define PORTB_28	60
#define PORTB_29	61
#define PORTB_30	62
#define PORTB_31	63
#define PORTC_0		64
#define PORTC_1		65
#define PORTC_2		66
#define PORTC_3		67
#define PORTC_4		68
#define PORTC_5		69
#define PORTC_6		70
#define PORTC_7		71
#define PORTC_8		72
#define PORTC_9		73
#define PORTC_10	74
#define PORTC_11	75
#define PORTC_12	76
#define PORTC_13	77
#define PORTC_14	78
#define PORTC_15	79
#define PORTC_16	80
#define PORTC_17	81
#define PORTC_18	82
#define PORTC_19	83
#define PORTC_20	84
#define PORTC_21	85
#define PORTC_22	86
#define PORTC_23	87
#define PORTC_24	88
#define PORTC_25	89
#define PORTC_26	90
#define PORTC_27	91
#define PORTC_28	92
#define PORTC_29	93
#define PORTC_30	94
#define PORTC_31	95
#define PORTD_0		96
#define PORTD_1		97
#define PORTD_2		98
#define PORTD_3		99
#define PORTD_4		100
#define PORTD_5		101
#define PORTD_6		102
#define PORTD_7		103
#define PORTD_8		104
#define PORTD_9		105
#define PORTD_10	106
#define PORTD_11	107
#define PORTD_12	108
#define PORTD_13	109
#define PORTD_14	110
#define PORTD_15	111
#define PORTD_16	112
#define PORTD_17	113
#define PORTD_18	114
#define PORTD_19	115
#define PORTD_20	116
#define PORTD_21	117
#define PORTD_22	118
#define PORTD_23	119
#define PORTD_24	120
#define PORTD_25	121
#define PORTD_26	122
#define PORTD_27	123
#define PORTD_28	124
#define PORTD_29	125
#define PORTD_30	126
#define PORTD_31	127
#define PORTE_0		128
#define PORTE_1		129
#define PORTE_2		130
#define PORTE_3		131
#define PORTE_4		132
#define PORTE_5		133
#define PORTE_6		134
#define PORTE_7		135
#define PORTE_8		136
#define PORTE_9		137
#define PORTE_10	138
#define PORTE_11	139
#define PORTE_12	140
#define PORTE_13	141
#define PORTE_14	142
#define PORTE_15	143
#define PORTE_16	144
#define PORTE_17	145
#define PORTE_18	146
#define PORTE_19	147
#define PORTE_20	148
#define PORTE_21	149
#define PORTE_22	150
#define PORTE_23	151
#define PORTE_24	152
#define PORTE_25	153
#define PORTE_26	154
#define PORTE_27	155
#define PORTE_28	156
#define PORTE_29	157
#define PORTE_30	158
#define PORTE_31	159
#define PORTF_0		160
#define PORTF_1		161
#define PORTF_2		162
#define PORTF_3		163
#define PORTF_4		164
#define PORTF_5		165
#define PORTF_6		166
#define PORTF_7		167
#define PORTF_8		168
#define PORTF_9		169
#define PORTF_10	170
#define PORTF_11	171
#define PORTF_12	172
#define PORTF_13	173
#define PORTF_14	174
#define PORTF_15	175
#define PORTF_16	176
#define PORTF_17	177
#define PORTF_18	178
#define PORTF_19	179
#define PORTF_20	180
#define PORTF_21	181
#define PORTF_22	182
#define PORTF_23	183
#define PORTF_24	184
#define PORTF_25	185
#define PORTF_26	186
#define PORTF_27	187
#define PORTF_28	188
#define PORTF_29	189
#define PORTF_30	190
#define PORTF_31	191

#endif
